--
-- 建筑名表.csv
-- 建筑编号编号 = id
-- 建筑名 = name
-- 坐标 = pos
-- 图标 = img

local data = {
    [1000] = {["id"] = 1000, ["name"] = "主城", ["pos"] = {-230, 220}, ["img"] = "name_1000"},
    [1100] = {["id"] = 1100, ["name"] = "鲜花地", ["pos"] = {-210, 230}, ["img"] = "name_1001"},
    [1200] = {["id"] = 1200, ["name"] = "摇钱树", ["pos"] = {-230, 230}, ["img"] = "name_1002"},
    [1300] = {["id"] = 1300, ["name"] = "采石场", ["pos"] = {-300, 280}, ["img"] = "name_1003"},
    [1400] = {["id"] = 1400, ["name"] = "伐木场", ["pos"] = {-300, 280}, ["img"] = "name_1004"},
    [400000] = {["id"] = 400000, ["name"] = "皇帝", ["pos"] = {-70, 40}, ["img"] = "name_400000"},
    [400001] = {["id"] = 400001, ["name"] = "小太监", ["pos"] = {-70, 40}, ["img"] = "name_400001"}
}

return data