--
-- 每日觐见表.csv
-- 官品编号 = id
-- 官品名称 = name
-- 剧情 = plot
-- 官品奖励 = dropID

local data = {
    [1] = {["id"] = 1, ["name"] = "从九品", ["plot"] = 1, ["dropID"] = 833},
    [2] = {["id"] = 2, ["name"] = "正九品", ["plot"] = 1, ["dropID"] = 833},
    [3] = {["id"] = 3, ["name"] = "从八品", ["plot"] = 1, ["dropID"] = 833},
    [4] = {["id"] = 4, ["name"] = "正八品", ["plot"] = 1, ["dropID"] = 833},
    [5] = {["id"] = 5, ["name"] = "从七品", ["plot"] = 1, ["dropID"] = 833},
    [6] = {["id"] = 6, ["name"] = "正七品", ["plot"] = 1, ["dropID"] = 833},
    [7] = {["id"] = 7, ["name"] = "从六品", ["plot"] = 1, ["dropID"] = 833},
    [8] = {["id"] = 8, ["name"] = "正六品", ["plot"] = 1, ["dropID"] = 833},
    [9] = {["id"] = 9, ["name"] = "从五品", ["plot"] = 1, ["dropID"] = 833},
    [10] = {["id"] = 10, ["name"] = "正五品", ["plot"] = 1, ["dropID"] = 833},
    [11] = {["id"] = 11, ["name"] = "从四品", ["plot"] = 1, ["dropID"] = 833},
    [12] = {["id"] = 12, ["name"] = "正四品", ["plot"] = 1, ["dropID"] = 833},
    [13] = {["id"] = 13, ["name"] = "从三品", ["plot"] = 1, ["dropID"] = 833},
    [14] = {["id"] = 14, ["name"] = "正三品", ["plot"] = 1, ["dropID"] = 833},
    [15] = {["id"] = 15, ["name"] = "从二品", ["plot"] = 1, ["dropID"] = 833},
    [16] = {["id"] = 16, ["name"] = "正二品", ["plot"] = 1, ["dropID"] = 833},
    [17] = {["id"] = 17, ["name"] = "从一品", ["plot"] = 1, ["dropID"] = 833},
    [18] = {["id"] = 18, ["name"] = "正一品", ["plot"] = 1, ["dropID"] = 833},
    [19] = {["id"] = 19, ["name"] = "超品加爵", ["plot"] = 1, ["dropID"] = 833}
}

return data