--
-- 中立派系表.csv
-- 中立派系编号 = id
-- 名称 = name
-- 权贵对象ID = object
-- 友好操作间隔时间 = time
-- 友好增加值 = arms
-- 离间减少值 = alienate

local data = {
    [1] = {["id"] = 1, ["name"] = "年家", ["object"] = {1, 9}, ["time"] = 7200, ["arms"] = {13000, 13000}, ["alienate"] = {13000, 13000}},
    [2] = {["id"] = 2, ["name"] = "萧家", ["object"] = {2, 10}, ["time"] = 7200, ["arms"] = {14000, 14000}, ["alienate"] = {14000, 14000}},
    [3] = {["id"] = 3, ["name"] = "李家", ["object"] = {3, 11}, ["time"] = 7200, ["arms"] = {15000, 15000}, ["alienate"] = {15000, 15000}},
    [4] = {["id"] = 4, ["name"] = "张家", ["object"] = {4, 12}, ["time"] = 7200, ["arms"] = {16000, 16000}, ["alienate"] = {16000, 16000}},
    [5] = {["id"] = 5, ["name"] = "宋家", ["object"] = {5, 13}, ["time"] = 7200, ["arms"] = {17000, 17000}, ["alienate"] = {17000, 17000}},
    [6] = {["id"] = 6, ["name"] = "徐家", ["object"] = {6, 14}, ["time"] = 7200, ["arms"] = {18000, 18000}, ["alienate"] = {18000, 18000}},
    [7] = {["id"] = 7, ["name"] = "司马家", ["object"] = {7, 15}, ["time"] = 7200, ["arms"] = {19000, 19000}, ["alienate"] = {19000, 19000}},
    [8] = {["id"] = 8, ["name"] = "诸葛家", ["object"] = {8, 16}, ["time"] = 7200, ["arms"] = {20000, 20000}, ["alienate"] = {20000, 20000}}
}

return data