--
-- 官权定义表.csv
-- 官权编号 = id
-- 官权名称 = name
-- 说明 = explain
-- 排序 = order
-- ICON图 = icon
-- 头像ICON = speakicon
-- 操作类型 = type
-- 对象目标 = object
-- 按钮出现的官品等级 = limitGrade
-- 按钮出现的玩家等级 = limitLv
-- 每日操作次数 = czNum
-- 每日被操作次数 = bczNum
-- 消耗道具 = costType
-- 消耗数量 = costNum
-- 剧情ID = talkID
-- 动画名 = animationName
-- 好友度增加 = gradeCharm
-- BUFF增加 = buffid
-- BUFF时间 = punishTime
-- 赠送道具类型 = item
-- 道具数量 = itemnum
-- 成功概率 = succeedFormula
-- 己方奖励 = reward

local data = {
    [1] = {["id"] = 1, ["name"] = "惩奸", ["explain"] = "别人聊天时语句断断续续", ["order"] = 1, ["icon"] = 1, ["speakicon"] = 40004, ["type"] = 5, ["object"] = 2, ["limitGrade"] = 13, ["limitLv"] = 1, ["czNum"] = {2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2}, ["bczNum"] = 1, ["punishTime"] = {360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360}, ["succeedFormula"] = {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1}},
    [3] = {["id"] = 3, ["name"] = "禁言", ["explain"] = "别人无法聊天", ["order"] = 2, ["icon"] = 3, ["speakicon"] = 40006, ["type"] = 8, ["object"] = 2, ["limitGrade"] = 17, ["limitLv"] = 1, ["czNum"] = {2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2}, ["bczNum"] = 1, ["punishTime"] = {360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360}, ["succeedFormula"] = {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1}},
    [4] = {["id"] = 4, ["name"] = "变猪", ["explain"] = "场景中模型变成猪", ["order"] = 3, ["icon"] = 4, ["speakicon"] = 40009, ["type"] = 4, ["object"] = 2, ["limitGrade"] = 8, ["limitLv"] = 1, ["czNum"] = {2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2}, ["bczNum"] = 1, ["punishTime"] = {360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360}, ["succeedFormula"] = {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1}},
    [5] = {["id"] = 5, ["name"] = "交友", ["explain"] = "提高自己的生命5%，持续12小时", ["order"] = 4, ["icon"] = 5, ["speakicon"] = 40010, ["type"] = 3, ["object"] = 4, ["limitGrade"] = 7, ["limitLv"] = 1, ["czNum"] = {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1}, ["bczNum"] = 1, ["talkID"] = 1, ["buffid"] = {13}, ["punishTime"] = {43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200}, ["succeedFormula"] = {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1}},
    [6] = {["id"] = 6, ["name"] = "传功", ["explain"] = "提高别人的攻击力5%，持续12小时,消耗100功勋", ["order"] = 5, ["icon"] = 6, ["speakicon"] = 40012, ["type"] = 2, ["object"] = 2, ["limitGrade"] = 9, ["limitLv"] = 1, ["czNum"] = {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1}, ["bczNum"] = 1, ["costType"] = {10012}, ["costNum"] = {100}, ["buffid"] = {10}, ["punishTime"] = {43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200}, ["succeedFormula"] = {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1}},
    [7] = {["id"] = 7, ["name"] = "指点", ["explain"] = "提高别人的防御力5%，持续12小时,消耗100功勋", ["order"] = 6, ["icon"] = 7, ["speakicon"] = 40013, ["type"] = 2, ["object"] = 2, ["limitGrade"] = 11, ["limitLv"] = 1, ["czNum"] = {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1}, ["bczNum"] = 1, ["costType"] = {10012}, ["costNum"] = {100}, ["buffid"] = {11, 12}, ["punishTime"] = {43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200, 43200}, ["succeedFormula"] = {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1}},
    [8] = {["id"] = 8, ["name"] = "约酒", ["explain"] = "提高你与对方的友好度", ["order"] = 7, ["icon"] = 8, ["speakicon"] = 40014, ["type"] = 6, ["object"] = 1, ["limitGrade"] = 4, ["limitLv"] = 1, ["czNum"] = {2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2}, ["bczNum"] = 1, ["gradeCharm"] = 10, ["punishTime"] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19}, ["succeedFormula"] = {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1}},
    [9] = {["id"] = 9, ["name"] = "赠送", ["explain"] = "给别人一点木材（通过邮件收取）", ["order"] = 8, ["icon"] = 9, ["speakicon"] = 40015, ["type"] = 1, ["object"] = 1, ["limitGrade"] = 2, ["limitLv"] = 1, ["czNum"] = {2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2}, ["bczNum"] = 1, ["gradeCharm"] = 30, ["punishTime"] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19}, ["item"] = {10009}, ["itemnum"] = {2000}, ["succeedFormula"] = {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1}}
}

return data