--
-- 职业类型表.csv
-- 编号 = id
-- 职业类型 = job
-- 描述 = desc

local data = {
    [1] = {["id"] = 1, ["job"] = "狂战", ["desc"] = "狂战，战士型职业，拥有很强的物理输出能力以及高爆发的能力，是战斗中支撑一个团队输出的重要角色。"},
    [2] = {["id"] = 2, ["job"] = "阵师", ["desc"] = "阵师，辅助型职业，拥有较高血量以及防御能力以及给友军增加护盾的能力，可化伤害于无形，保护整只队伍。"},
    [3] = {["id"] = 3, ["job"] = "贤者", ["desc"] = "贤者，牧师型职业，拥有中等血量以及防御能力以及顶尖的治愈能力，能让队伍在艰难战斗中能让团队柳暗花明。"},
    [4] = {["id"] = 4, ["job"] = "隐士", ["desc"] = "隐士，法师型职业，拥有很强的法术输出能力以及群攻的能力，在战斗中可以轻易在万军之中取残血首级如探囊取物。"}
}

return data