--
-- 怪物掉落表.csv
-- 掉落编号 = id
-- 随机次数 = num
-- 掉落物品 = itemId
-- 掉落数量 = itemNum
-- 掉落几率 = prob
-- 首次必掉 = fstDrop
-- 首次必掉数量 = fstDropNum
-- 保底物品判断 = bdpdItem
-- 保底判断次数 = bdpdNum
-- 保底掉落物品 = bdDropItem
-- 保底掉落物品数量 = bdDropNum
-- 保底掉落概率 = bdDropProb

local data = {
    [100] = {["id"] = 100, ["num"] = 1, ["itemId"] = 12084, ["itemNum"] = 1, ["prob"] = 1.0},
    [10000] = {["id"] = 10000},
    [10001] = {["id"] = 10001},
    [10002] = {["id"] = 10002},
    [10003] = {["id"] = 10003, ["num"] = 1},
    [10004] = {["id"] = 10004},
    [10005] = {["id"] = 10005, ["num"] = 1},
    [10006] = {["id"] = 10006},
    [10007] = {["id"] = 10007, ["num"] = 1},
    [10100] = {["id"] = 10100},
    [10101] = {["id"] = 10101, ["num"] = 1},
    [10102] = {["id"] = 10102},
    [10103] = {["id"] = 10103},
    [10104] = {["id"] = 10104},
    [10105] = {["id"] = 10105, ["num"] = 1},
    [10106] = {["id"] = 10106},
    [10107] = {["id"] = 10107},
    [10108] = {["id"] = 10108},
    [10109] = {["id"] = 10109, ["num"] = 1},
    [10110] = {["id"] = 10110},
    [10111] = {["id"] = 10111}
}

return data