--
-- 头像表.csv
-- 编号 = id
-- 仆从 = servant
-- 图标 = icon

local data = {
    [24700] = {["id"] = 24700, ["servant"] = 1000, ["icon"] = "head_1000"},
    [24701] = {["id"] = 24701, ["servant"] = 1001, ["icon"] = "head_1001"},
    [24702] = {["id"] = 24702, ["servant"] = 40004, ["icon"] = "head_40004"},
    [24703] = {["id"] = 24703, ["servant"] = 40008, ["icon"] = "head_40008"},
    [24704] = {["id"] = 24704, ["servant"] = 40009, ["icon"] = "head_40009"},
    [24705] = {["id"] = 24705, ["servant"] = 40010, ["icon"] = "head_40010"},
    [24706] = {["id"] = 24706, ["servant"] = 40014, ["icon"] = "head_40014"},
    [24707] = {["id"] = 24707, ["servant"] = 40015, ["icon"] = "head_40015"},
    [24708] = {["id"] = 24708, ["servant"] = 40017, ["icon"] = "head_40017"},
    [24709] = {["id"] = 24709, ["servant"] = 40020, ["icon"] = "head_40020"}
}

return data