--
-- 变强途径.csv
-- 编号 = id
-- 变强标题 = head
-- 变强描述 = des
-- 快捷入口 = entrance
-- 任务图标 = icon

local data = {
    [1000] = {["id"] = 1000, ["head"] = "装备强化", ["des"] = "日常副本可以获得大量铜钱来强化装备", ["entrance"] = 1000, ["icon"] = 11220},
    [1001] = {["id"] = 1001, ["head"] = "装备进阶", ["des"] = "通关副本可以获得大量进阶材料用来进阶装备", ["entrance"] = 1000, ["icon"] = 11235},
    [1002] = {["id"] = 1002, ["head"] = "获取客卿", ["des"] = "抽取更强的客卿来加强阵容", ["entrance"] = 1013, ["icon"] = 100},
    [1003] = {["id"] = 1003, ["head"] = "客卿升级", ["des"] = "通关副本可以获得大量升材料用来升级客卿", ["entrance"] = 1003, ["icon"] = 12001},
    [1004] = {["id"] = 1004, ["head"] = "客卿进阶", ["des"] = "通关副本可以获得大量进阶材料用来进阶客卿", ["entrance"] = 1003, ["icon"] = 200},
    [1005] = {["id"] = 1005, ["head"] = "阵法升级", ["des"] = "击败世界首领可以获得大量的阵法升级道具", ["entrance"] = 1002, ["icon"] = 31026}
}

return data