--
-- 官场每日俸禄表.csv
-- 编号 = id
-- 官品 = name
-- 官场排名 = ranking
-- 俸禄 = salary

local data = {
    [1] = {["id"] = 1, ["name"] = 1, ["salary"] = {807}},
    [2] = {["id"] = 2, ["name"] = 2, ["salary"] = {808}},
    [3] = {["id"] = 3, ["name"] = 3, ["salary"] = {809}},
    [4] = {["id"] = 4, ["name"] = 4, ["salary"] = {810}},
    [5] = {["id"] = 5, ["name"] = 5, ["salary"] = {811}},
    [6] = {["id"] = 6, ["name"] = 6, ["salary"] = {812}},
    [7] = {["id"] = 7, ["name"] = 7, ["salary"] = {813}},
    [8] = {["id"] = 8, ["name"] = 8, ["salary"] = {814}},
    [9] = {["id"] = 9, ["name"] = 9, ["salary"] = {815}},
    [10] = {["id"] = 10, ["name"] = 10, ["salary"] = {816}},
    [11] = {["id"] = 11, ["name"] = 11, ["salary"] = {817}},
    [12] = {["id"] = 12, ["name"] = 12, ["salary"] = {818}},
    [13] = {["id"] = 13, ["name"] = 13, ["salary"] = {819}},
    [14] = {["id"] = 14, ["name"] = 14, ["salary"] = {820}},
    [15] = {["id"] = 15, ["name"] = 15, ["salary"] = {821}},
    [16] = {["id"] = 16, ["name"] = 16, ["salary"] = {822}},
    [17] = {["id"] = 17, ["name"] = 17, ["salary"] = {823}},
    [18] = {["id"] = 18, ["name"] = 18, ["salary"] = {824}},
    [19] = {["id"] = 19, ["name"] = 19, ["salary"] = {825}}
}

return data