--
-- 功能开启表.csv
-- 编号 = id
-- 系统名称 = name
-- 开放等级 = openLv
-- 对应引导 = ydId
-- 是否开启显示 = show
-- 任务引导ID = MissionId
-- 系统图标名字 = icon
-- 系统UI = uiId
-- 系统提示 = tishi

local data = {
    [101] = {["id"] = 101, ["name"] = "镶嵌", ["openLv"] = 1, ["show"] = 1},
    [102] = {["id"] = 102, ["name"] = "悬赏", ["openLv"] = 10, ["show"] = 1},
    [103] = {["id"] = 103, ["name"] = "武将本", ["openLv"] = 16, ["show"] = 1},
    [104] = {["id"] = 104, ["name"] = "普通本", ["openLv"] = 4, ["show"] = 1},
    [105] = {["id"] = 105, ["name"] = "任务", ["openLv"] = 1, ["show"] = 1},
    [106] = {["id"] = 106, ["name"] = "抽卡", ["openLv"] = 1, ["show"] = 1},
    [107] = {["id"] = 107, ["name"] = "官品", ["openLv"] = 13, ["show"] = 5},
    [108] = {["id"] = 108, ["name"] = "时装", ["openLv"] = 1, ["show"] = 1},
    [109] = {["id"] = 109, ["name"] = "派系", ["openLv"] = 12, ["show"] = 1},
    [110] = {["id"] = 110, ["name"] = "好友", ["openLv"] = 11, ["show"] = 1},
    [112] = {["id"] = 112, ["name"] = "聊天", ["openLv"] = 10, ["show"] = 1},
    [113] = {["id"] = 113, ["name"] = "邮件", ["openLv"] = 1, ["show"] = 1},
    [114] = {["id"] = 114, ["name"] = "签到", ["openLv"] = 1, ["show"] = 1},
    [115] = {["id"] = 115, ["name"] = "每日任务", ["openLv"] = 7, ["show"] = 1},
    [116] = {["id"] = 116, ["name"] = "成就", ["openLv"] = 1, ["show"] = 1},
    [117] = {["id"] = 117, ["name"] = "羁绊", ["openLv"] = 18, ["show"] = 1},
    [118] = {["id"] = 118, ["name"] = "世界BOSS", ["openLv"] = 1, ["show"] = 1},
    [119] = {["id"] = 119, ["name"] = "爬塔", ["openLv"] = 15, ["show"] = 1, ["MissionId"] = {37016}},
    [120] = {["id"] = 120, ["name"] = "装备强化", ["openLv"] = 1, ["show"] = 1},
    [121] = {["id"] = 121, ["name"] = "装备进阶", ["openLv"] = 3, ["show"] = 1},
    [122] = {["id"] = 122, ["name"] = "武将升级", ["openLv"] = 1, ["show"] = 1},
    [123] = {["id"] = 123, ["name"] = "武将进阶", ["openLv"] = 1, ["show"] = 1},
    [124] = {["id"] = 124, ["name"] = "阵型升级", ["openLv"] = 1, ["show"] = 1},
    [125] = {["id"] = 125, ["name"] = "拜见皇上", ["openLv"] = 1, ["show"] = 1},
    [126] = {["id"] = 126, ["name"] = "商城", ["openLv"] = 1, ["show"] = 1},
    [127] = {["id"] = 127, ["name"] = "排行", ["openLv"] = 1, ["show"] = 1},
    [128] = {["id"] = 128, ["name"] = "家园", ["openLv"] = 14, ["show"] = 1},
    [129] = {["id"] = 129, ["name"] = "家园采矿", ["openLv"] = 14, ["show"] = 1},
    [130] = {["id"] = 130, ["name"] = "家园伐木", ["openLv"] = 20, ["show"] = 1},
    [131] = {["id"] = 131, ["name"] = "家园花房", ["openLv"] = 18, ["show"] = 1},
    [132] = {["id"] = 132, ["name"] = "家园摇钱树", ["openLv"] = 25, ["show"] = 1},
    [133] = {["id"] = 133, ["name"] = "扫荡功能", ["openLv"] = 9, ["show"] = 1},
    [134] = {["id"] = 134, ["name"] = "困难副本", ["openLv"] = 7, ["show"] = 1}
}

return data