package com.gamejelly.gong2.config.data;

import com.gamejelly.gong2.config.data.base.LData;
import com.gamejelly.gong2.config.data.base.LMap;

/**
 * 短信对话组表.csv
 * 编号 = id
 * 对话组 = talk
 * 战斗后对话组 = afterTalk
 */
public class BirdLetterZuDat extends LData {
    public static final LMap data = new LMap();

    static {
        init0();
        init1();
        init2();
        data.setFrozen(true);
    }

    private static void init0() {
data.map(
    10000, map("id", 10000, "talk", list(1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15)),
    10001, map("id", 10001, "talk", list(16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27)),
    10002, map("id", 10002, "talk", list(28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41)),
    10003, map("id", 10003, "talk", list(42, 43, 44, 45, 46, 47, 48, 49, 50, 51)),
    10004, map("id", 10004, "talk", list(52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71))
);
    }

    private static void init1() {
data.map(
    10005, map("id", 10005, "talk", list(72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87)),
    10006, map("id", 10006, "talk", list(88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112)),
    10007, map("id", 10007, "talk", list(113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125)),
    10008, map("id", 10008, "talk", list(126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141)),
    10009, map("id", 10009, "talk", list(142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153))
);
    }

    private static void init2() {
data.map(
    10010, map("id", 10010, "talk", list(154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175)),
    10011, map("id", 10011, "talk", list(176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193)),
    10012, map("id", 10012, "talk", list(194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226))
);
    }

}