--
-- 称号表.csv
-- id = id
-- 称号名 = name
-- 获取渠道 = qudao
-- 属性id = propId
-- 增加属性 = propValue
-- 类型 = type
-- 重置 = czDay
-- 图标 = icon

local data = {
    [90002] = {["id"] = 90002, ["name"] = "冠盖京华", ["qudao"] = "贵族达到3级", ["propId"] = {10051, 10052, 10053, 10054}, ["propValue"] = {125, 50, 50, 1500}, ["type"] = 2, ["czDay"] = 1, ["icon"] = "chenghao_vip3"},
    [90009] = {["id"] = 90009, ["name"] = "灵舒望月", ["qudao"] = "贵族达到10级", ["propId"] = {10051, 10052, 10053, 10054, 10056, 10057, 10059, 10060, 10062, 10063}, ["propValue"] = {500.0, 200.0, 200.0, 600.0, 0.03, 0.03, 0.01, 0.01, 0.01, 0.01}, ["type"] = 2, ["czDay"] = 1, ["icon"] = "chenghao_vip10"},
    [90014] = {["id"] = 90014, ["name"] = "惊鸿照影", ["qudao"] = "贵族达到15级", ["propId"] = {10051, 10052, 10053, 10054, 10056, 10057, 10059, 10060, 10062, 10063}, ["propValue"] = {563.0, 225.0, 225.0, 6750.0, 0.04, 0.04, 0.02, 0.02, 0.02, 0.02}, ["type"] = 2, ["czDay"] = 1, ["icon"] = "chenghao_vip15"}
}

return data