--
-- 剧情回顾表.csv
-- 编号 = id
-- 对话组 = talk
-- 男女回顾区分 = diff
-- 通关主线 = coustom
-- 对应场景 = sense
-- 对应立绘 = people
-- 章节描述 = des

local data = {
    [2] = {["id"] = 2, ["talk"] = {10000}, ["diff"] = 0, ["coustom"] = 1, ["sense"] = "sense_1", ["people"] = "chapter1", ["des"] = "回到家中后，继母锦绣慈面，千方百计设计婚事，意图将你在七日内嫁出，此时突然发现似乎家中继母并不简单，与父亲入狱一事有千丝万缕的关系……"},
    [3] = {["id"] = 3, ["talk"] = {10001}, ["diff"] = 0, ["coustom"] = 2, ["sense"] = "sense_2", ["people"] = "chapter2", ["des"] = "你在家中找打了一封来自枫山主人的信件，信件提醒父亲要慎之又慎，没想到父亲最终还是陷入了漩涡之中，为了救父亲出狱，洗脱污名，你最终还是决定前往枫山行宫一趟，见一见枫山之主到底是何方神圣！"},
    [4] = {["id"] = 4, ["talk"] = {10002}, ["diff"] = 0, ["coustom"] = 3, ["sense"] = "sense_3", ["people"] = "chapter3", ["des"] = "你在枫山救了一名来历不凡之人，方回到家不久便获得了见面的邀约。你依约前往，父亲在此人帮助下也顺利脱困，但是因为继母莽撞行事的缘故，你将被送往宫中成为一名女官……"},
    [5] = {["id"] = 5, ["talk"] = {10003}, ["diff"] = 0, ["coustom"] = 4, ["sense"] = "sense_4", ["people"] = "chapter4", ["des"] = "宫中的生活没有想象中那么危机起伏，平静到十分乏味。正当你以为日子就会这么平静下去的时候，突然之间，风云突变……"},
    [6] = {["id"] = 6, ["talk"] = {10004}, ["diff"] = 0, ["coustom"] = 5, ["sense"] = "sense_5", ["people"] = "chapter5", ["des"] = "因为得罪了德妃娘娘的缘故，你搬入了观星台。一日，国师派你去临江楼办差，没想到你却在临江楼中遇到了被送往别院修养的继母与妹妹……"},
    [7] = {["id"] = 7, ["talk"] = {10005}, ["diff"] = 0, ["coustom"] = 6, ["sense"] = "sense_6", ["people"] = "chapter6", ["des"] = "你在太子别院被一个刺客所掳，情急之下你花言巧语哄骗了刺客顺利出逃，没想到太子居然是……"},
    [9] = {["id"] = 9, ["talk"] = {20000}, ["diff"] = 1, ["coustom"] = 1, ["sense"] = "sense_1", ["people"] = "chapter1", ["des"] = "前往南府求援的你，却被南府门人所驱赶。救人心切，你只能选择强闯南府。好在南府如今主事颇为心善，听闻此事后，派遣了一位心腹侍卫承影随你前往枫山救人。"},
    [10] = {["id"] = 10, ["talk"] = {20001}, ["diff"] = 1, ["coustom"] = 2, ["sense"] = "sense_2", ["people"] = "chapter2", ["des"] = "来时尚且平静的枫山猎场，突然杀机迸现。你带着承影越过重重艰险，来到破庙救人。不料，却又出现了一位自称是本朝国师姬长雍的男子。你自觉无力抗衡，选择将重伤的颜北归交给他后离开枫山。"},
    [11] = {["id"] = 11, ["talk"] = {20002}, ["diff"] = 1, ["coustom"] = 3, ["sense"] = "sense_3", ["people"] = "chapter3", ["des"] = "你敏锐地察觉到了金陵城中的暗潮涌动，想要离开，却被书童洗砚所劝阻，安心留在了来去寺备考。未曾想，当夜房中却来了个无名杀手，直言要取了你的性命……"},
    [12] = {["id"] = 12, ["talk"] = {20003}, ["diff"] = 1, ["coustom"] = 4, ["sense"] = "sense_4", ["people"] = "chapter4", ["des"] = "被突然出现的暗卫所救的你，随他来到了长风别苑，并知晓了此处的主人乃本朝太子姬燕来。他似乎颇为欣赏你的才华与品行，竟留你在此小住。你推辞不得，只好在此住下，并因此见到了本朝圣上——姬长生。"},
    [13] = {["id"] = 13, ["talk"] = {20004}, ["diff"] = 1, ["coustom"] = 5, ["sense"] = "sense_5", ["people"] = "chapter5", ["des"] = "姬长生似乎对你颇感兴趣，直言要考教你，命你前往临江楼调查前几日的凶案。你只身来到楼中，却遇到了许久未见的故人。他告诉你了临江楼凶案的细节，你顺线索追去，发现临江楼的马夫有异。查探之下，这人竟是名来自西域的刀客。"},
    [14] = {["id"] = 14, ["talk"] = {20005}, ["diff"] = 1, ["coustom"] = 6, ["sense"] = "sense_6", ["people"] = "chapter6", ["des"] = "你选择及时收手，进宫将情况禀明姬长生。姬长生对你大家赞赏，并让你回家准备春闱。不料，姬燕来竟交予你两枚锦囊，让你秘密前往姑苏寻找心腹。你无可奈何，只好应下并前往姑苏。"}
}

return data