--
-- VIP限购表.csv
-- 编号 = id
-- 名称 = name
-- VIP等级 = vipLv
-- 道具 = item
-- 道具数量 = itemNum
-- 领取次数 = num

local data = {
    [1001] = {["id"] = 1001, ["name"] = "VIP 1", ["vipLv"] = 1, ["item"] = {20201, 20204}, ["itemNum"] = {5, 5}, ["num"] = 1},
    [1002] = {["id"] = 1002, ["name"] = "VIP 2", ["vipLv"] = 2, ["item"] = {22043, 22016}, ["itemNum"] = {2, 2}, ["num"] = 1},
    [1003] = {["id"] = 1003, ["name"] = "VIP 3", ["vipLv"] = 3, ["item"] = {22030, 20047}, ["itemNum"] = {5, 5}, ["num"] = 1},
    [1004] = {["id"] = 1004, ["name"] = "VIP 4", ["vipLv"] = 4, ["item"] = {22024, 20048}, ["itemNum"] = {1, 4}, ["num"] = 1},
    [1005] = {["id"] = 1005, ["name"] = "VIP 5", ["vipLv"] = 5, ["item"] = {94072, 20049}, ["itemNum"] = {50, 3}, ["num"] = 1},
    [1006] = {["id"] = 1006, ["name"] = "VIP 6", ["vipLv"] = 6, ["item"] = {20216, 24113}, ["itemNum"] = {20, 20}, ["num"] = 1},
    [1007] = {["id"] = 1007, ["name"] = "VIP 7", ["vipLv"] = 7, ["item"] = {20641, 20215}, ["itemNum"] = {10, 20}, ["num"] = 1},
    [1008] = {["id"] = 1008, ["name"] = "VIP 8", ["vipLv"] = 8, ["item"] = {20626, 94067}, ["itemNum"] = {1, 2}, ["num"] = 1},
    [1009] = {["id"] = 1009, ["name"] = "VIP 9", ["vipLv"] = 9, ["item"] = {20627, 94068}, ["itemNum"] = {1, 2}, ["num"] = 1},
    [1010] = {["id"] = 1010, ["name"] = "VIP 10", ["vipLv"] = 10, ["item"] = {20641, 20050}, ["itemNum"] = {20, 3}, ["num"] = 1},
    [1011] = {["id"] = 1011, ["name"] = "VIP 11", ["vipLv"] = 11, ["item"] = {94076, 20050}, ["itemNum"] = {3, 4}, ["num"] = 1},
    [1012] = {["id"] = 1012, ["name"] = "VIP 12", ["vipLv"] = 12, ["item"] = {94076, 20309}, ["itemNum"] = {4, 50}, ["num"] = 1},
    [1013] = {["id"] = 1013, ["name"] = "VIP 13", ["vipLv"] = 13, ["item"] = {94077, 20051}, ["itemNum"] = {1, 3}, ["num"] = 1},
    [1014] = {["id"] = 1014, ["name"] = "VIP 14", ["vipLv"] = 14, ["item"] = {94077, 20051}, ["itemNum"] = {1, 4}, ["num"] = 1},
    [1015] = {["id"] = 1015, ["name"] = "VIP 15", ["vipLv"] = 15, ["item"] = {94077, 90321}, ["itemNum"] = {1, 3}, ["num"] = 1}
}

return data